#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```

stdout:
module.satire_bot.aws_iam_user.event_notifier: Refreshing state... [id=event-emitter]
module.satire_bot.aws_iam_role.assume_role: Refreshing state... [id=iam_for_lambda]
module.satire_bot.aws_iam_access_key.event_notifier: Refreshing state... [id=AKIAWE4GYV5JSGUH4E57]
module.satire_bot.aws_lambda_function.satire_lambdas["pong_ping"]: Refreshing state... [id=pong_ping]
module.satire_bot.aws_lambda_function.satire_lambdas["ping_pong"]: Refreshing state... [id=ping_pong]
module.satire_bot.aws_iam_user_policy.event_notifier: Refreshing state... [id=event-emitter:terraform-20220406033055018800000001]
module.satire_bot.heroku_app.satire_bot: Refreshing state... [id=dd7d7dee-674b-4701-b711-91270c700004]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.satire_bot.aws_iam_user_policy.event_notifier has changed
  ~ resource "aws_iam_user_policy" "event_notifier" {
        id     = "event-emitter:terraform-20220406033055018800000001"
      + name   = "terraform-20220406033055018800000001"
        # (2 unchanged attributes hidden)
    }

  # module.satire_bot.aws_lambda_function.satire_lambdas["ping_pong"] has changed
  ~ resource "aws_lambda_function" "satire_lambdas" {
        id                             = "ping_pong"
      + layers                         = []
      + tags                           = {}
        # (25 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.satire_bot.aws_lambda_function.satire_lambdas["pong_ping"] has changed
  ~ resource "aws_lambda_function" "satire_lambdas" {
        id                             = "pong_ping"
      + layers                         = []
      + tags                           = {}
        # (25 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.satire_bot.heroku_build.satire_bot will be created
  + resource "heroku_build" "satire_bot" {
      + app_id            = "dd7d7dee-674b-4701-b711-91270c700004"
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = "SHA256:edd20ac89fe4d5a7f5ed05422071548a584eff40553d6480a90bd28e8492156a"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "../satire-bot/iac/.."
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

stderr:

```

</details>